results/oltp_read_only_8thr_2m/20240214-184352_c7538a2c20178ecd32662de3200cfe9fff19e8a3_1.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 212.52 qps: 3470.08 (r/w/o: 3037.07/0.00/433.01) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 235.14 qps: 3762.21 (r/w/o: 3291.94/0.00/470.28) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 247.00 qps: 3955.00 (r/w/o: 3461.00/0.00/494.00) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 249.00 qps: 3996.01 (r/w/o: 3498.01/0.00/498.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 253.00 qps: 4047.99 (r/w/o: 3541.99/0.00/506.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 254.00 qps: 4061.00 (r/w/o: 3553.00/0.00/508.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 252.00 qps: 4014.97 (r/w/o: 3510.98/0.00/504.00) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 257.00 qps: 4118.00 (r/w/o: 3604.00/0.00/514.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 245.91 qps: 3932.50 (r/w/o: 3441.69/0.00/490.81) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 257.99 qps: 4135.91 (r/w/o: 3618.93/0.00/516.99) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 267.11 qps: 4261.72 (r/w/o: 3727.50/0.00/534.22) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 253.00 qps: 4067.97 (r/w/o: 3561.97/0.00/506.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 252.00 qps: 4044.04 (r/w/o: 3540.03/0.00/504.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 257.00 qps: 4084.01 (r/w/o: 3570.01/0.00/514.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 260.99 qps: 4191.77 (r/w/o: 3669.80/0.00/521.97) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 258.96 qps: 4127.30 (r/w/o: 3609.39/0.00/517.91) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 279.06 qps: 4475.96 (r/w/o: 3917.84/0.00/558.12) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 275.97 qps: 4429.55 (r/w/o: 3877.61/0.00/551.94) lat (ms,99%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 268.98 qps: 4271.67 (r/w/o: 3733.71/0.00/537.96) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 260.00 qps: 4171.02 (r/w/o: 3651.02/0.00/520.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 269.04 qps: 4312.68 (r/w/o: 3774.59/0.00/538.08) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 262.97 qps: 4198.57 (r/w/o: 3672.63/0.00/525.95) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 261.03 qps: 4188.53 (r/w/o: 3666.47/0.00/522.07) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 269.96 qps: 4310.33 (r/w/o: 3770.41/0.00/539.92) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 269.99 qps: 4311.91 (r/w/o: 3771.92/0.00/539.99) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 252.98 qps: 4051.73 (r/w/o: 3545.77/0.00/505.97) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 257.99 qps: 4125.77 (r/w/o: 3609.79/0.00/515.97) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 266.08 qps: 4259.29 (r/w/o: 3727.13/0.00/532.16) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 260.99 qps: 4177.89 (r/w/o: 3655.90/0.00/521.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 263.01 qps: 4207.09 (r/w/o: 3681.08/0.00/526.01) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 256.00 qps: 4105.99 (r/w/o: 3593.99/0.00/512.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 254.00 qps: 4047.00 (r/w/o: 3539.00/0.00/508.00) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 261.00 qps: 4180.03 (r/w/o: 3658.02/0.00/522.00) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 261.99 qps: 4195.77 (r/w/o: 3671.80/0.00/523.97) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 260.01 qps: 4161.22 (r/w/o: 3641.19/0.00/520.03) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 258.96 qps: 4160.29 (r/w/o: 3642.38/0.00/517.91) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 255.04 qps: 4060.68 (r/w/o: 3550.59/0.00/510.09) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 269.00 qps: 4323.04 (r/w/o: 3785.03/0.00/538.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 268.00 qps: 4279.92 (r/w/o: 3743.93/0.00/535.99) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 271.00 qps: 4335.04 (r/w/o: 3793.03/0.00/542.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 261.93 qps: 4201.88 (r/w/o: 3678.02/0.00/523.86) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 261.02 qps: 4166.26 (r/w/o: 3644.23/0.00/522.03) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 256.96 qps: 4122.33 (r/w/o: 3608.42/0.00/513.92) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 264.10 qps: 4210.58 (r/w/o: 3682.38/0.00/528.20) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 273.00 qps: 4365.98 (r/w/o: 3819.99/0.00/546.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 283.00 qps: 4520.95 (r/w/o: 3954.96/0.00/565.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 281.90 qps: 4516.45 (r/w/o: 3952.64/0.00/563.81) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 274.09 qps: 4374.40 (r/w/o: 3827.22/0.00/547.17) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 262.01 qps: 4210.16 (r/w/o: 3685.14/0.00/525.02) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 269.00 qps: 4293.94 (r/w/o: 3755.95/0.00/537.99) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 261.00 qps: 4191.04 (r/w/o: 3669.03/0.00/522.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 272.96 qps: 4338.29 (r/w/o: 3792.38/0.00/545.91) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 290.03 qps: 4662.46 (r/w/o: 4082.40/0.00/580.06) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 281.00 qps: 4464.04 (r/w/o: 3902.04/0.00/562.01) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 279.95 qps: 4521.19 (r/w/o: 3961.29/0.00/559.90) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 279.02 qps: 4438.26 (r/w/o: 3880.23/0.00/558.03) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 268.05 qps: 4302.76 (r/w/o: 3766.67/0.00/536.09) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 270.00 qps: 4314.98 (r/w/o: 3774.98/0.00/540.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 286.00 qps: 4569.02 (r/w/o: 3997.02/0.00/572.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 278.98 qps: 4465.72 (r/w/o: 3907.75/0.00/557.96) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 295.00 qps: 4724.01 (r/w/o: 4134.01/0.00/590.00) lat (ms,99%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 286.02 qps: 4566.29 (r/w/o: 3994.25/0.00/572.04) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 278.00 qps: 4458.98 (r/w/o: 3902.98/0.00/556.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 282.00 qps: 4518.04 (r/w/o: 3954.03/0.00/564.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 268.00 qps: 4302.95 (r/w/o: 3766.95/0.00/535.99) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 279.91 qps: 4455.60 (r/w/o: 3895.77/0.00/559.82) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 275.02 qps: 4391.37 (r/w/o: 3841.32/0.00/550.05) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 276.00 qps: 4434.02 (r/w/o: 3882.02/0.00/552.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 273.01 qps: 4355.15 (r/w/o: 3809.13/0.00/546.02) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 263.05 qps: 4220.83 (r/w/o: 3694.72/0.00/526.10) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 262.00 qps: 4178.01 (r/w/o: 3654.01/0.00/524.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 257.82 qps: 4146.15 (r/w/o: 3630.50/0.00/515.65) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 268.10 qps: 4294.59 (r/w/o: 3758.39/0.00/536.20) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 272.07 qps: 4356.14 (r/w/o: 3812.00/0.00/544.14) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 276.02 qps: 4382.26 (r/w/o: 3830.22/0.00/552.03) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 266.91 qps: 4268.57 (r/w/o: 3734.74/0.00/533.82) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 265.95 qps: 4260.14 (r/w/o: 3728.25/0.00/531.89) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 262.06 qps: 4214.92 (r/w/o: 3690.81/0.00/524.11) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 270.93 qps: 4299.93 (r/w/o: 3758.06/0.00/541.86) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 265.15 qps: 4269.36 (r/w/o: 3739.07/0.00/530.29) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 270.98 qps: 4331.66 (r/w/o: 3789.70/0.00/541.96) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 274.97 qps: 4412.51 (r/w/o: 3862.57/0.00/549.94) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 270.95 qps: 4336.15 (r/w/o: 3794.25/0.00/541.89) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 271.11 qps: 4340.74 (r/w/o: 3798.52/0.00/542.22) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 271.00 qps: 4337.01 (r/w/o: 3795.01/0.00/542.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 271.92 qps: 4340.71 (r/w/o: 3796.87/0.00/543.84) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 270.96 qps: 4344.29 (r/w/o: 3802.38/0.00/541.91) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 273.06 qps: 4332.00 (r/w/o: 3785.87/0.00/546.13) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 265.06 qps: 4264.96 (r/w/o: 3734.84/0.00/530.12) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 274.00 qps: 4397.96 (r/w/o: 3849.96/0.00/547.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 266.92 qps: 4252.70 (r/w/o: 3718.86/0.00/533.84) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 263.08 qps: 4204.33 (r/w/o: 3678.16/0.00/526.17) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 269.91 qps: 4330.58 (r/w/o: 3790.76/0.00/539.82) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 263.08 qps: 4195.23 (r/w/o: 3669.07/0.00/526.15) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 272.01 qps: 4358.17 (r/w/o: 3814.15/0.00/544.02) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 269.00 qps: 4304.97 (r/w/o: 3766.97/0.00/538.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 259.93 qps: 4177.80 (r/w/o: 3657.95/0.00/519.85) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 269.04 qps: 4294.70 (r/w/o: 3756.61/0.00/538.09) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 277.94 qps: 4443.07 (r/w/o: 3887.18/0.00/555.88) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 270.02 qps: 4329.25 (r/w/o: 3789.22/0.00/540.03) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 8 tps: 262.07 qps: 4196.18 (r/w/o: 3672.03/0.00/524.15) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 8 tps: 271.00 qps: 4327.02 (r/w/o: 3785.01/0.00/542.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 8 tps: 268.00 qps: 4303.96 (r/w/o: 3767.96/0.00/535.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 8 tps: 273.00 qps: 4370.94 (r/w/o: 3824.94/0.00/545.99) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 8 tps: 272.99 qps: 4337.89 (r/w/o: 3791.90/0.00/545.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 8 tps: 270.00 qps: 4330.95 (r/w/o: 3790.96/0.00/539.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 8 tps: 271.00 qps: 4319.00 (r/w/o: 3777.00/0.00/542.00) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 8 tps: 276.00 qps: 4441.06 (r/w/o: 3889.05/0.00/552.01) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 8 tps: 282.98 qps: 4507.75 (r/w/o: 3941.78/0.00/565.97) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 282.01 qps: 4517.23 (r/w/o: 3953.20/0.00/564.03) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 8 tps: 281.00 qps: 4493.99 (r/w/o: 3931.99/0.00/562.00) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 8 tps: 292.00 qps: 4699.01 (r/w/o: 4115.01/0.00/584.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 8 tps: 280.93 qps: 4480.96 (r/w/o: 3919.09/0.00/561.87) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 8 tps: 270.01 qps: 4329.15 (r/w/o: 3789.13/0.00/540.02) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 8 tps: 280.05 qps: 4470.88 (r/w/o: 3910.77/0.00/560.11) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 8 tps: 270.95 qps: 4333.23 (r/w/o: 3791.33/0.00/541.90) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 8 tps: 282.96 qps: 4528.37 (r/w/o: 3962.45/0.00/565.92) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 8 tps: 282.10 qps: 4512.54 (r/w/o: 3948.35/0.00/564.19) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 8 tps: 294.01 qps: 4689.13 (r/w/o: 4101.11/0.00/588.02) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 299.00 qps: 4783.02 (r/w/o: 4185.02/0.00/598.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      20.736 |                                         1
      21.112 |                                         4
      21.496 |                                         5
      21.886 |                                         8
      22.284 |                                         18
      22.689 |                                         30
      23.101 |*                                        52
      23.521 |**                                       111
      23.948 |**                                       153
      24.384 |****                                     277
      24.827 |******                                   420
      25.278 |**********                               717
      25.737 |*************                            941
      26.205 |******************                       1272
      26.681 |*************************                1801
      27.165 |*******************************          2229
      27.659 |**********************************       2435
      28.162 |***************************************  2790
      28.673 |**************************************** 2864
      29.194 |***************************************  2825
      29.725 |************************************     2580
      30.265 |******************************           2162
      30.815 |**************************               1839
      31.375 |*******************                      1335
      31.945 |**************                           995
      32.525 |**********                               740
      33.116 |*******                                  518
      33.718 |*****                                    368
      34.330 |****                                     295
      34.954 |***                                      217
      35.589 |***                                      205
      36.236 |**                                       175
      36.894 |**                                       141
      37.565 |**                                       111
      38.247 |**                                       112
      38.942 |*                                        70
      39.650 |*                                        49
      40.370 |*                                        38
      41.104 |                                         35
      41.851 |                                         26
      42.611 |*                                        48
      43.385 |*                                        66
      44.173 |*                                        79
      44.976 |**                                       144
      45.793 |**                                       131
      46.625 |**                                       145
      47.472 |**                                       133
      48.335 |**                                       128
      49.213 |**                                       117
      50.107 |*                                        60
      51.018 |*                                        51
      51.945 |*                                        41
      52.889 |                                         30
      53.850 |                                         16
      54.828 |                                         13
      55.824 |                                         10
      56.839 |                                         8
      57.871 |                                         4
      58.923 |                                         2
      59.993 |                                         1
      62.193 |                                         2
      63.323 |                                         1
      64.474 |                                         2
      65.645 |                                         1
      66.838 |                                         3
      68.053 |                                         3
      70.548 |                                         4
      71.830 |                                         1
 
SQL statistics:
    queries performed:
        read:                            450912
        write:                           0
        other:                           64416
        total:                           515328
    transactions:                        32208  (268.34 per sec.)
    queries:                             515328 (4293.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      268.3388
    time elapsed:                        120.0274s
    total number of events:              32208

Latency (ms):
         min:                                   20.82
         avg:                                   29.81
         max:                                   72.09
         99th percentile:                       49.21
         sum:                               960070.00

Threads fairness:
    events (avg/stddev):           4026.0000/6.60
    execution time (avg/stddev):   120.0087/0.01